package bot.presentation.console;

final public class ConsoleMessages {

    static final String WELCOME =
        """
        ============================================
              Добро пожаловать в Recall Bot!
        ============================================
        
        Привет! Я Recall Bot — твой помощник
        в изучении и запоминании материала.

        Я использую карточки для повторения:
        сначала ты видишь вопрос и вспоминаешь ответ,
        а затем проверяешь себя.

        Через некоторое время я предложу тебе
        повторить карточку, чтобы проверить,
        насколько хорошо ты запомнил материал.

        Интервал до следующего повторения зависит
        от того, насколько легко тебе удалось
        вспомнить ответ. Поэтому для максимальной
        эффективности важно оценивать себя честно.

        Давай начнём учиться!

        Введи /help, чтобы посмотреть список команд.
        ============================================
        """;

    static final String GOODBYE =
        """
        ============================================
        Тренировка завершена!
        Спасибо за занятие и до встречи!
        ============================================
        """;

    static final String UNKNOWN_COMMAND =
            "Неизвестная команда. Введи /help для вызова списка доступных команд.";

    static final String HELP = """
        Правила тренировки:

        1. Прочитайте английское слово.
        2. Попробуйте вспомнить перевод.
        3. Нажмите Enter, чтобы открыть ответ.
        4. Оцените свой ответ:
           
           1/AGAIN — не удалось вспомнить.
           2/HARD — вспомнил с трудом.
           3/GOOD — вспомнил.
           4/EASY — вспомнил легко.

        Команды:
        /start — начать тренировку.
        /help — показать эту справку.
        /exit — завершить работу.
        /continue - продолжить работу.
        """;

    static final String GRADE_OPTIONS = """
        Оцените, насколько хорошо вы вспомнили ответ:

        1 или AGAIN — не удалось вспомнить.
        2 или HARD — вспомнил с трудом.
        3 или GOOD — вспомнил.
        4 или EASY — вспомнил легко.
        """;

    static final String TRAINING_FINISHED =
            "Тренировка завершена!";

    static final String INVALID_ACTION = """ 
                    Сейчас это действие недоступно.
                    Введи /help, чтобы узнать доступные команды.
                    """;

    static final String NO_CARDS =
            "В этой колоде пока нет карточек.";

    private ConsoleMessages() {
    }
}
